app/controllers/nadas_controller.rb

  def index
    @nadas = Nada.all
---
SELECT * FROM "nadas"

  def show
    @nada = Nada.find(params[:id])
---
SELECT * FROM "nadas" WHERE ("nadas"."id" = 1)

  def edit
    @nada = Nada.find(params[:id])
---
SELECT * FROM "nadas" WHERE ("nadas"."id" = 4)

  def create
    @nada = Nada.new(params[:nada])

    respond_to do |format|
      if @nada.save
---
INSERT INTO "nadas" ("created_at", "image_filename", "image_url", "updated_at", "text", "link_tag") VALUES('2009-08-08 22:06:04', '', '', '2009-08-08 22:06:04', 'Mother''s Cookies', 'd8204d65a3819835718b86bd770c0096ae767929')